Fix formatting and update secrets baseline
